Repository: 84000/data-translation-memory
Catalog: toh138_84000-the-ratnaketu-dharani.tmx
Source language: bo
Languages: en

source: གླང་ཆེན་རྔ་མོ་སེང་གེ་མ་ཧེ་སྟག་གཏུམ་སྒྲ་དྲག་དབྱར་དུས་ཀྱི། །འབྲུག་སྒྲ་འབྱིན་པ་ལྟ་བུ་དུ་མ་གྲོང་དེའི་ཕྱི་རོལ་མྱུར་སྤྲུལ་ཏེ།
en: The wild and fierce sounds of lions, tigers, elephants, and camels, like roaring summer thunder.

source: །བདག་ཅག་ལག་ཆ་མཚོན་ཐོགས་འདུག་པ་ངོ་མཚར་མངོན་སུམ་དེ་མཐོང་ན།
en: We shall wait with our weapons at the ready, so that he will see the miraculous display with his own eyes.

source: །བསླད་ཅིང་མི་དྲན་རྫུ་འཕྲུལ་སྟོར་ཏེ་དེ་ནས་ཐ་དད་ཕྱོགས་སུ་འགྲོ།
en: Baffled, he will lose his magical power and flee, losing his bearings and sense of direction.”

source: ལམ་སྲང་བཞི་མདོ་རྟ་བབས་དག་ན་མི་སྡུག་གདོང་མངས་འཁོད།
en: “Standing in great numbers by the four gateways straddling the four main roads with contorted faces,

source: །སྣ་ཚོགས་མཚོན་རྣོན་མདའ་ཆེན་མདའ་ཞགས་བརླ་དགས་རལ་གྲི་ཐོགས།
en: Brandishing various weapons—sharp spears, arrows, barbed missiles, and swords—

source: །ནམ་མཁའ་ལས་ཀྱང་མཚོན་ཆའི་སྒྲ་གྲག་སྤྲིན་ལས་ལྕེ་ཡང་འབེབས།
en: We shall attack from the sky with loud shrieks, releasing bolts from the clouds.

source: །དེ་ནས་ས་གཡོས་འཇིགས་པས་དབང་མེད་མྱུར་དུ་མ་རུངས་འགྱུར།
en: Terrified by the earthquakes, he will soon lose all control and meet his doom.”

source: །བདུད་དེ་དག་གིས་བདུད་ཀྱི་ཡུལ་གྱི་སྟོབས་དང་། རྣམ་པར་སྤྲུལ་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཐམས་ཅད་རྒྱ་ཆེར་བྱས་སོ།
en: And, as far as the extent of the māras’ magical power would allow, they enacted everything in full.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་ཐམས་ཅད་དང་ལྡན་པའི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྡོ་རྗེར་བྱིན་གྱིས་བརླབས་ནས་བདུད་ཀྱི་སྒྲ་ཡང་མི་འབྱིན།
en: The Blessed One, however, turned this entire world sphere—the great trichiliocosm—into diamond.

source: ཕྱོགས་བཞི་ན་མེ་དང་རི་ཡང་མེད།
en: Subsequently no māras were able to make any sounds, and no mountains of fire stood in the four directions.

source: སྤྲིན་ནག་པོ་ཡང་མེད། དུས་མ་ཡིན་པའི་རླུང་ཡང་མེད་དེ།
en: There were no black clouds and no unseasonable winds.

source: སངས་རྒྱས་ཀྱི་སྟོབས་དང་བྱིན་གྱི་རླབས་ཀྱིས་ཀླུ་གང་ཡང་ཐ་ན་ཆར་པ་ཐིགས་པ་གཅིག་ཙམ་ཡང་མི་འབེབས་སོ།
en: No nāga was able to send even a single drop of rain—all this through the power of the Buddha’s blessing.

source: །ཡང་དེའི་ཚེ་ཉན་ཐོས་ཆེན་པོ་བཞི་སྔ་དྲོ་ཆོས་གོས་དང་ཤམ་ཐབས་བགོས། ལྷུང་བཟེད་ཐོགས་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཞུགས་ཏེ།
en: Around that time, in the morning, four great hearers put on their lower garments and robes and, bearing their alms bowls, entered the great city of Rājagṛha to beg alms.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གྲོང་ཁྱེར་གྱི་ལྷོ་ཕྱོགས་ཀྱི་སྒོ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཞུགས་པ་དང་། གྲོང་ཁྱེར་གྱི་སྒོ་དེ་ན་བདུད་གཞོན་ནུ་ཤིན་ཏུ་དར་ལ་བབ་པ། བྱད་བཞིན་བཟང་བ། བཙུན་པའི་ཆ་བྱད་དང་འདྲ་བ་ལྔ་བཅུ་གླུ་ལེན་གར་བྱེད་ཅིང་ཀུན་ཏུ་རྒྱུ་སྟེ།
en: Venerable Śāriputra entered the city through the southern gate to beg alms. There, in the city, fifty māra youths, endowed with supreme youthful beauty, attired to resemble sons of distinguished personages, roamed about dancing and singing.

source: དེ་དག་གིས་ལག་པ་གཉིས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་ལ་བཟུང་ནས་སྲང་དུ་རྒྱུག་ཅིང་གླུ་ལེན་གར་བྱེད་དེ། ཤཱ་རིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དགེ་སྦྱོང་གླུ་ལོང་ཤིག །དགེ་སྦྱོང་གར་བྱོས་ཤིག །ཤཱ་རིའི་བུས་སྨྲས་པ།
en: They seized Venerable Śāriputra by both hands and pranced along the street. Dancing and singing, they urged him, “Dance, monk!

source: གྲོགས་པོ་དག་ཁྱེད་ཀྱིས་སྔོན་མ་ཐོས་པའི་གླུ་ཐོས་པར་བྱ་ཡིས་ཉོན་ཅིག །བདུད་གཞོན་ནུ་དེ་དག་ཐམས་ཅད་ཀྱིས་གཅོམ་བསྐྱུངས་པ་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་རྒྱུག་ཅིང་གླུའི་དབྱངས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ། །སྐྱེ་མཆེད་དག་གིས་ཤིན་ཏུ་ཆོག །སྐྱེ་མཆེད་དག་གིས་བདག་ཅག་བསླུས།
en: Sing, monk!” Śāriputra replied, “Listen, friends, as I sing you a song that you have not heard before.” All the māra youths, moving onward, then sang the following in unison with Śāriputra: “Enough of the sense bases; We are deceived by them.

source: །སྐྱེ་མཆེད་དག་ནི་གསོད་པ་སྟེ།
en: Sense bases are killers;

source: །སྐྱེ་མཆེད་དག་གིས་མཐར་དབྱུང་ངོ་།
en: I will put an end to them. “Enough of the aggregates;

source: །ཕུང་པོ་བྱས་པས་ཤིན་ཏུ་ཆོག །ཕུང་པོ་བྱས་པས་བདག་ཅག་བསླུས།
en: We are deceived by them.

source: །ཕུང་པོ་བྱས་པ་གསོད་པ་སྟེ།
en: Aggregates are killers;

source: །ཕུང་པོ་བྱས་པ་ངས་མཐར་དབྱུང་།
en: will put an end to them.

source: །འདི་ལྟ་སྟེ།
en: “The mantra is:

source: བ་ཧ་ར། བ་ཧ་ར། བྷ་ར་བ་ཧ། མ་རི་ཙཻ་བ་ཧ། ས་ཏྱ་བ་ཧ་ཨཱ་མ་བ་ཧ་སྭཱ་ཧཱ།
en: bahara bahara bhārabaha marīci­baha satya­baha āmabaha svāhā

source: གནས་བརྟན་ཤཱ་རིའི་བུ་རྒྱུག་ཅིང་། གླུའི་དབྱངས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་དང་། གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྨྲས་པ་དང་། དེ་ནས་བདུད་གཞོན་ནུ་ལྔ་བཅུ་པོ་དེ་དག་ཤིན་ཏུ་དགའ་སྟེ་ཡིད་རབ་ཏུ་དད་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Elder Śāriputra sang this stanza and recited the words of the mantra while bounding along with the fifty māra youths, who, supremely thrilled and kindly disposed, said:

source: །མགོན་པོ་བདག་ཅག་དེ་རིང་བཟོད་པར་གསོལ།
en: “We now ask you, our protector, for forgiveness.

source: །འགྲོ་བའི་གཉེན་གཅིག་སྟོན་པའི་མཆོག་ཁྱོད་དེ། །ཕུང་པོ་ཁྱོད་ཀྱིས་ཇི་ལྟར་འཇིགས་བཅས་བཤད།
en: You are truly a kinsman of beings, a great teacher.

source: །བདག་ཅག་དེ་ལྟར་རྟག་ཏུ་དེ་མངོན་སུམ།
en: We will always bear witness to the fact That the aggregates are fraught with danger, just as you have declared.”

source: །བདུད་གཞོན་ནུ་ལྔ་བཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་སྲང་གི་དབུས་དེར་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་དེའི་མདུན་དུ་འདུག་གོ།
en: They all bowed their heads to the feet of Śāriputra and sat down in front of him, in the middle of the street, to hear the Dharma.

source: །དེ་ནས་མཽད་གལ་གྱི་བུ་གྲོང་ཁྱེར་གྱི་ཤར་ཕྱོགས་ཀྱི་སྒོ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཞུགས་པ་དང་། དེ་ནས་ཡང་བདུད་གཞོན་ནུ་ལྔ་བཅུ་ནས་གླུའི་དབྱངས་ཀྱི་བར་དུ་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Around the same time, the great Venerable Maudgalyāyana entered the great city of Rājagṛha through the eastern gate, in order to beg alms. But as before, fifty māra youths sang the following in unison with Maudgalyāyana: “Enough of the elements;

source: །ཁམས་ཉིད་དག་གིས་ཤིན་ཏུ་ཆོག །ཁམས་ཉིད་དག་གིས་བདག་ཅག་བསླུས།
en: We are deceived by them.

source: །ཁམས་ཉིད་དག་ནི་གསོད་པ་སྟེ།
en: The elements are killers;

source: །ཁམས་ཉིད་བདག་གིས་མཐར་དབྱུང་ངོ་།
en: I will put an end to them.

source: །ཚོར་བ་དག་གིས་ཤིན་ཏུ་ཆོག །ཚོར་བ་དག་གིས་བདག་ཅག་བསླུས།
en: “Enough of sensations; We are deceived by them.

source: །ཚོར་བ་དག་ནི་གསོད་པ་སྟེ།
en: Sensations are killers;

source: །ཚོར་བ་དག་གིས་མཐར་དབྱུང་ངོ་།
en: I will put an end to them.

source: །སེམས་པ་དག་གིས་ཤིན་ཏུ་ཆོག །སེམས་པ་དག་གིས་བདག་ཅག་བསླུས།
en: “Enough of intentions; We are deceived by them.

source: །སེམས་པ་དག་ནི་གསོད་པ་སྟེ།
en: Intentions are killers;

source: །སེམས་པ་བདག་གིས་མཐར་དབྱུང་ངོ་།
en: I will put an end to them.

source: །འདུ་ཤེས་བྱས་པས་ཤིན་ཏུ་ཆོག །འདུ་ཤེས་བྱས་པས་བདག་ཅག་བསླུས།
en: “Enough of perception; We are deceived by it.

source: །འདུ་ཤེས་བྱས་པ་གསོད་པ་སྟེ།
en: Perception is a killer;

source: །འདུ་ཤེས་བྱས་པས་ངས་མཐར་དབྱུང་།
en: I will put an end to it. “Enough of saṃsāra;

source: །འཁོར་བ་དག་གིས་ཤིན་ཏུ་ཆོག །འཁོར་བ་དག་གིས་བདག་ཅག་བསླུ།
en: We are deceived by it.

source: །འཁོར་བ་དག་ནི་གསོད་པ་སྟེ།
en: Saṃsāra is a killer;

source: །འཁོར་བ་བདག་གིས་མཐར་དབྱུང་ངོ་།
en: I will put an end to it.

source: །འདི་ལྟ་སྟེ། ཨཱ་མ་བ།
en: “The mantra is:

source: ཨཱ་མ་བ། ཨཱ་མ་བ། ཨཱ་ར་ཛ། ན་ར་ཛ་ཧ་ཤ་མ་མྱ་ཐ། ཤ་མ་མྱ་ཐ་ག་གན་བ་སྭཱ་ཧཱ།
en: āmava āmava āmava āmava āraja ranajaha śamyatha śamyatha śamyatha gagana­vama svāhā

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་རྒྱུག་ཅིང་གླུའི་དབྱངས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་དང་། གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྨྲས་པ་དང་། དེ་ནས་བདུད་གཞོན་ནུ་ལྔ་བཅུ་པོ་དེ་དག་ཤིན་ཏུ་དགའ་སྟེ་ཡིད་རབ་ཏུ་དད་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The great Maudgalyāyana sang these stanzas and recited the words of the mantra to the sons of Māra while bounding along with them. Subsequently, the fifty māra youths, supremely thrilled and kindly disposed, said:

source: །འཕྲུལ་ལྡན་སྦས་པ་འཕགས་ལམ་ཐུབ་དབང་སྲས།
en: “O son of the lord of sages, endowed with magical power and protected by the noble path!

source: །འཁོར་བའི་ཉེས་ལ་མཉམ་ལྟ་ཆོས་ཀྱི་སྒྲོན།
en: You are the lamp of Dharma who shows how to pacify the evils of saṃsāra.

source: །སྡིག་སྤངས་བདག་ཅག་རི་མོ་གུས་པ་སྐྱེས།
en: We have now renounced evil and developed respect and devotion.

source: །སངས་རྒྱས་ཆོས་མཆོག་དགེ་འདུན་དེང་སྐྱབས་སོ།
en: Today we take refuge in the Buddha, the supreme Dharma, and the Saṅgha.”

source: །བདུད་གཞོན་ནུ་ལྔ་བཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་སྲང་གི་དབུས་དེར་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་དེའི་མདུན་དུ་འདུག་གོ།
en: The fifty māra youths bowed their heads to the feet of Venerable Maudgalyāyana and sat down in front of him, in the middle of the street, to hear the Dharma.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་གྲོང་ཁྱེར་གྱི་བྱང་ཕྱོགས་ཀྱི་སྒོ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཞུགས་པ་དང་། དེ་ནས་ཡང་བདུད་གཞོན་ནུ་ལྔ་བཅུ་ནས་གླུའི་དབྱངས་ཀྱི་བར་དུ་སྟེ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Around the same time, Venerable Pūrṇa, the son of Maitrāyaṇī, entered the city through the northern gate to beg alms. As before, fifty māra youths sang in unison with him: “Enough of sensory contact;

source: །རེག་པ་བྱས་པས་ཤིན་ཏུ་ཆོག །རེག་པ་བྱས་པས་བདག་ཅག་བསླུས།
en: We are deceived by it.

source: །རེག་པ་བྱས་པས་གསོད་པ་སྟེ།
en: Sensory contact is a killer;

source: །རེག་པ་བདག་གིས་མཐར་དབྱུང་ངོ་།
en: I will put an end to it. “Enough of the controlling forces;

source: །བདག་པོ་དག་གིས་ཤིན་ཏུ་ཆོག །བདག་པོ་དག་གིས་བདག་ཅག་བསླུས།
en: We are deceived by them.

source: །བདག་པོ་དག་ནི་གསོད་པ་སྟེ།
en: Controlling forces are killers;

source: །བདག་པོ་བདག་གིས་མཐར་དབྱུང་ངོ་།
en: I will put an end to them. “Enough of saṃsāra;

source: །འཁོར་བ་དག་གིས་ཤིན་ཏུ་ཆོག །འཁོར་བ་དག་གིས་བདག་ཅག་བསླུས།
en: We are deceived by it.

source: །འཁོར་བ་དག་གིས་མཐར་དབྱུང་ངོ་།
en: I will put an end to it. “Enough of all becoming;

source: །སྲིད་པ་ཀུན་གྱིས་ཤིན་ཏུ་ཆོག །སྲིད་པ་ཀུན་གྱིས་བདག་ཅག་བསླུས།
en: We are deceived by it.

source: །སྲིད་པ་ཀུན་ནི་གསོད་པ་སྟེ།
en: Becoming is a killer;

source: །སྲིད་པ་ཀུན་ནི་ངས་མཐར་དབྱུང་།
en: I will put an end to it.

source: །འདོད་པའི་དགའ་བས་ཤིན་ཏུ་ཆོག །འདོད་པའི་དགའ་བས་བདག་ཅག་བསླུས།
en: “Enough of delight in sense pleasure; We are deceived by it.

source: །འདོད་པའི་དགའ་བས་གསོད་པ་སྟེ།
en: Delight in sense pleasure is a slaughterhouse;

source: །འདོད་པའི་དགའ་བ་ངས་མཐར་དབྱུང་།
en: I will put an end to it.

source: །གྲོགས་དག་ཚེ་འདི་མྱུར་འགྲོ་སྟེ།
en: “Life passes quickly, my friends;

source: །རི་གཟར་ཆུ་དྲག་མགྱོགས་འདྲ་ན།
en: Fast flows the water.

source: །བྱིས་པའི་སྐྱེ་བོས་མི་ཤེས་ཏེ།
en: A naive person doesn’t know this—

source: །མི་མཁས་གཟུགས་ཀྱི་དྲེགས་པས་མྱོས།
en: Such a fool gets infatuated with form

source: །དེ་བཞིན་དུ་སྦྱར་ཏེ།
en: “Likewise, as before, he gets infatuated with sound,

source: མི་མཁས་སྒྲ་ཡི་དྲེགས་པས་མྱོས།
en: He gets infatuated with odor,

source: །མི་མཁས་དྲི་ཡི་དྲེགས་པས་མྱོས། །མི་མཁས་རོ་ཡི་དྲེགས་པས་མྱོས།
en: He gets infatuated with taste,

source: །མི་མཁས་རེག་གི་དྲེགས་པས་མྱོས།
en: And he gets infatuated with touch.

source: །མི་མཁས་ཆོས་ཀྱི་དྲེགས་པས་མྱོས།
en: Such a fool gets infatuated with phenomena.

source: །མི་མཁས་ཕུང་པོའི་དྲེགས་པས་མྱོས།
en: “Likewise, as before, he gets infatuated with the aggregates,

source: །མི་མཁས་ཁམས་ཀྱི་དྲེགས་པས་མྱོས།
en: He gets infatuated with the psycho-physical elements,

source: །མི་མཁས་ལོངས་སྤྱོད་དྲེགས་པས་མྱོས།
en: He gets infatuated with sensual enjoyments,

source: །མི་མཁས་བདེ་བའི་དྲེགས་པས་མྱོས།
en: He gets infatuated with comforts,

source: །མི་མཁས་རིགས་ཀྱི་དྲེགས་པས་མྱོས།
en: He gets infatuated with caste,

source: །མི་མཁས་འདོད་པའི་དྲེགས་པས་མྱོས།
en: And he gets infatuated with sex.

source: །མི་མཁས་ཀུན་གྱི་དྲེགས་པས་མྱོས།
en: Such a fool gets infatuated with everything.

source: །འདི་ལྟ་སྟེ། ཁརྒ་བ། ཁརྒ་བ། ཁརྒ་བ། མུན་ཉི་ནི།
en: “The mantra is:

source: ཨཱ་བརྟ། བི་བརྟ། ཁ་བརྟེ། པྲ་མ་ཨརྛ། ཛྱོ་ཏི་ར་བརྟ་སྭ་ཧཱ།
en: khargava khargava khargava mujñini āvarta vivarta khavarta bramārtha jyotivarta svāhā

source: ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོ་རྒྱུག་ཅིང་གླུའི་དབྱངས་ཀྱིས་བདུད་ཀྱི་བུ་རྣམས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་དང་། གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྨྲས་པ་དང་། དེ་ནས་བདུད་གཞོན་ནུ་ལྔ་བཅུ་པོ་དེ་དག་ཤིན་ཏུ་དགའ་སྟེ། ཡིད་རབ་ཏུ་དགའ་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Venerable Pūrṇa sang these stanzas and recited the words of the mantra to the sons of Māra while bounding along with them. Subsequently, the fifty māra youths, supremely thrilled and kindly disposed, said:

source: །ཁམས་རྣམས་སྒྱུ་མ་སྨིག་རྒྱུ་འདྲ་བ་དང་། །འཚོ་བའི་འཇིག་རྟེན་རྟོག་པས་བསྐྱེད་པ་དང་། །ཞི་བའི་ལམ་ཡང་ཁྱོད་ཀྱིས་ཉེ་བར་བསྟན།
en: “You have shown us the path of calming the mind. The elements are illusory like a mirage or a reflected image. This world of beings is produced by concepts.

source: །མཆོག་སྦྱིན་དཀོན་མཆོག་གསུམ་ལ་སྐྱབས་སུ་མཆི།
en: We go for refuge to the Three Jewels, who are ready to answer our prayers.”

source: །བདུད་གཞོན་ནུ་ལྔ་བཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་སྲང་གི་དབུས་དེར་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོའི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་དེའི་མདུན་དུ་འདུག་གོ།
en: All fifty of the māra youths bowed their heads to the feet of Venerable Pūrṇa and sat down in front of him, in the middle of the street, to hear the Dharma.

source: །ཡང་དེའི་ཚེ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ནུབ་ཕྱོགས་ཀྱི་སྒོ་ནས་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོར་བསོད་སྙོམས་ཀྱི་ཕྱིར་ཞུགས་པ་དང་། གྲོང་ཁྱེར་གྱི་སྒོ་དེ་ན་བདུད་གཞོན་ནུ་ཤིན་ཏུ་དར་ལ་བབ་པ། བྱད་བཞིན་བཟང་བ་བཙུན་པའི་ཆ་བྱད་འཆང་བ་ལྔ་བཅུ་གླུ་ལེན་གར་བྱེད་ཅིང་ཀུན་ཏུ་རྒྱུ་བ་དེ་དག་གིས་ལག་པ་གཉིས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་བཟུང་ནས་སྲང་དུ་རྒྱུག་ཅིང་གླུ་ལེན་གར་བྱེད་དེ།
en: Around the same time, Venerable Subhūti entered the great city of Rājagṛha through the western gate to beg alms. There, at the gate to the city, fifty māra youths, endowed with supreme youthful beauty, attired to resemble sons of distinguished personages, gallavanted about, dancing and singing.

source: རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: They seized Venerable Subhūti by both hands and, prancing along the street, urged him, “Dance, monk!

source: །དགེ་སྦྱོང་གླུ་ལོང་ཤིག །དགེ་སྦྱོང་གར་བྱོས་ཤིག །རབ་འབྱོར་གྱིས་སྨྲས་པ།
en: Sing, monk!”

source: གྲོགས་པོ་དག་ཁྱེད་ཅིས་སྔོན་མ་ཐོས་པའི་གླུ་ཐོས་པར་བྱ་ཡིས་ཉོན་ཅིག །དེ་དག་གིས་གཅོམ་བསྐྱུངས་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་རྒྱུག་ཅིང་གླུའི་དབྱངས་ཀྱིས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Subhūti replied, “Listen, friends, as I sing you a song that you have not heard before.” Then all of them fell silent. Moving along with them, Venerable Subhūti sang the following:

source: །དངོས་པོ་ཐམས་ཅད་མི་རྟག་སྒྱུ་མ་ཆུ་བུར་བཞིན།
en: “All things are impermanent; they are like illusions or bubbles on water.

source: །འདུས་བྱས་གཡོ་བའི་རང་བཞིན་གང་ལའང་རྟག་པ་མེད།
en: All conditioned things are impermanent and by nature unstable.

source: །སྨིག་རྒྱུ་མཐོང་ནས་ཞིག་བཞིན་དེ་ལ་ཐེར་ཟུག་མེད།
en: Just as a mirage disappears as soon as it is seen, so, too, is there no permanence in them.

source: །ཆོས་ཀུན་མྱུར་དུ་འཇིག་པར་བློ་དང་ལྡན་པས་ཤེས།
en: An intelligent person knows that all phenomena are easily destroyed. “All sensory contact brings suffering, as sensation has no essence.

source: །སྡུག་བསྔལ་ཆོས་གཟིར་བྱིས་པ་ཐམས་ཅད་གར་ཆགས་པ།
en: All naive people get stuck right there, afflicted by painful phenomena.

source: །རེག་ཀུན་སྡུག་བསྔལ་ཁུར་ཡིན་ཚོར་བ་དག་ཀྱང་མེད།
en: There is no friend who would liberate one from all suffering

source: །ཇི་ལྟར་དད་པ་བྱང་ཆུབ་ལམ་བསྒོམ་བསྟེན་བྱེད་པ། །དེ་ལྟར་སྡུག་བསྔལ་ཀུན་ཐར་བྱེད་གྲོགས་གང་ཡང་མེད།
en: Like the faith that leads to awakening and the practice of meditation.

source: །ཆོས་ཀུན་མཚན་ཉིད་གཅིག་སྟེ་འདུ་ཤེས་སྤངས་པ་དགེ།
en: “All phenomena have one trait in common—they are good once conceptions are abandoned.

source: །བདག་མེད་ལྡན་པས་སྤྱོད་ཀུན་རྫས་ཀྱི་མཚན་ཉིད་བདག །སྲོག་དང་གསོ་བ་གང་ཟག་དང་ནི་བྱེད་པ་མེད།
en: All conduct has no self and is insubstantial. There is no living entity, vital principle, person, or agent.

source: །བདུད་ཀྱི་གཡོ་དག་ཐོང་ལ་སེམས་ནི་བྱང་ཆུབ་བསྔོས།
en: You should reject the deceptions of Māra and incline your mind toward awakening.

source: །ནམ་མཁའི་གློག་བཞིན་དབང་པོ་དག་ལ་རྣམ་ཤེས་འབྱུང་།
en: “Consciousness operates within the sense faculties like lightning in the sky.

source: །རེག་དང་ཚོར་དང་སེམས་པ་ཐམས་ཅད་བདག་མེད་དེ།
en: All sensory contact, sensation, and mental activity are devoid of self.

source: །ཚུལ་བཞིན་བརྟགས་ན་རྫས་ནི་ཅི་ཡང་ཡོད་མ་ཡིན།
en: Everything, when examined appropriately, is insubstantial.

source: །བྱིས་པའི་སྡེ་རྣམས་བསླུས་པས་འཁྲུལ་འཁོར་བཞིན་དུ་འཇུག །ཕུང་པོར་ཐམས་ཅད་ཚུལ་བཞིན་བརྟགས་ན་བྱེད་པ་མེད།
en: Naive people, stupefied, function like automatons. “ If the aggregates are comprehended to the core, no agent can be found.

source: །ཡང་དག་མཐའ་ནི་སྟོང་ཞིང་མཐའ་རྣམས་ཀུན་དང་བྲལ།
en: Ultimately, everything is peaceful, empty, and free from extremes.

source: །བྱང་ཆུབ་ལམ་སྤྱོད་དེས་ནི་འདྲེན་པས་བྱང་ཆུབ་བརྙེས།
en: This is called the sphere of nondelusion and constitutes the path to awakening.

source: །རྨོངས་མེད་ཆོས་ཉིད་འདི་ནི་ཆོས་སུ་སྐྱོབ་པས་གསུངས།
en: To attain awakening, you must follow the guide and protector.”

source: སུ་མུན་དེ། བི་མུན་དེ། སུན་ད་ཛ་ཏི། སི་ལི་སི་ལི་སི་ལི། ཨ་བ་སི་ལི།
en: sumunde vimunde munda jahi sili sili sili avasili tathātva­sili bhūta­koṭi­sili svāhā

source: ཨ་བ་ཧ་སི་ལི། ཏ་ཐ་ཏཱ་སི་ལི། བྷུ་ཏ་ཀོ་ཊི་སི་ལི་སྭཱ་ཧཱ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་རྒྱུག་ཅིང་གླུའི་དབྱངས་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་དང་། གསང་སྔགས་ཀྱི་ཚིག་འདི་དག་སྨྲས་པ་དང་། དེ་ནས་བདུད་གཞོན་ནུ་ལྔ་བཅུ་པོ་དེ་དག་ཤིན་ཏུ་དགའ་སྟེ། ཡིད་རབ་ཏུ་དད་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: Venerable Subhūti sang these stanzas and recited the words of the mantra to the sons of Māra while bounding along with them. Subsequently, the fifty māra youths, supremely thrilled and kindly disposed, said:

source: །སྡིག་པའི་གྲོགས་ཀྱི་དབང་སོང་འདི་འདྲའི་ཆོས་མ་ཐོས།
en: “Not having heard these teachings before, we were under the influence of bad friends.

source: །གཏི་མུག་མི་ཤེས་དངོས་པོས་སྡིག་ལས་ཅི་བགྱིས་པ།
en: Whatever bad actions we have thus committed through delusion and ignorance,

source: །རྒྱལ་བའི་སྲས་ལ་བདག་ཅག་མངོན་སུམ་དེང་བཤགས་ན།
en: We now confess before you, O son of the victorious ones!

source: །འགྲོ་ལ་ཕན་ཕྱིར་སངས་རྒྱས་ཉིད་དུ་སྨོན་དགེ་འདེབས།
en: We make a solemn vow to attain buddhahood for the benefit of the world.”

source: །བདུད་གཞོན་ནུ་ལྔ་བཅུ་པོ་དེ་དག་ཐམས་ཅད་ཀྱིས་སྲང་གི་དབུས་དེར་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱི་རྐང་པ་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ཆོས་མཉན་པའི་ཕྱིར་དེའི་མདུན་དུ་འདུག་གོ།
en: All fifty of the māra youths bowed their heads to the feet of Venerable Subhūti and sat down in front of him, in the middle of the street, to hear the Dharma.

source: །ཡང་དེའི་ཚེ་ན་སངས་རྒྱས་ཀྱི་མཐུས་སྲང་དེ་དཔག་ཚད་བརྒྱ་ཙམ་དུ་གོ་སྐབས་ཡངས་པར་སྣང་སྟེ།
en: At the same time, through the power of the Buddha, the street appeared stretched to a radius of one hundred leagues.

source: སྲང་དེའི་དབུས་ན་གནས་བརྟན་ཤཱ་རིའི་བུ་ནི་བྱང་ཕྱོགས་སུ་བལྟས་ཏེ་འདུག །མཽད་གལ་གྱི་བུ་ཆེན་པོ་ནི་ནུབ་ཕྱོགས་སུ་བལྟས་ཏེ་འདུག །གང་པོ་ནི་ལྷོ་ཕྱོགས་སུ་བལྟས་ཏེ་འདུག །རབ་འབྱོར་ནི་ཤར་ཕྱོགས་སུ་བལྟས་ཏེ་འདུག་ནས་གཅིག་ནས་གཅིག་ཏུ་དཔག་ཚད་ཕྱེད་ཕྱེད་ཙམ་ན་འཁོད་དོ།
en: In the middle were seated Elder Śāriputra, the great Maudgalyāyana, Pūrṇa, and Subhūti, facing north, west, south, and east respectively and positioned at a distance of half a league from one another.

source: །ཉན་ཐོས་ཆེན་པོ་བཞི་པོ་དེ་དག་གི་དབུས་ཀྱི་སའི་ཕྱོགས་ན་ཁྲུ་ལྔ་བཅུས་འཁོར་བའི་པད་མ་ཆུ་བ་ནི་འཛམ་བུའི་ཆུ་བོའི་གསེར། འདབ་མ་ནི་བཻ་དཱུརྱ་སྔོན་པོ། །ཟེ་བ་ནི་དཔལ་གྱི་སྙིང་པོ། །སྙིང་པོ་ནི་མུ་ཏིག །དྲི་ནི་ལྷའི་སྤོས་ལས་ལྷག་པ། འཇིག་རྟེན་ལས་འདས་པའི་དགེ་བའི་རྩ་བ་ལས་སྐྱེས་པ་ཞིག་བྱུང་སྟེ།
en: In the center of the area between these great four hearers a lotus appeared—fifty cubits in diameter, with a golden stalk, petals of blue beryl, stamens of śrīgarbha, and a pericarp of pearl.

source: པད་མོ་དེ་ལས་སྣང་བ་བྱུང་ངོ་། །སྣང་བ་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བར་གྱུར་ཏེ། སྲང་དེ་ན་པད་མ་དེ་འཕང་དུ་མི་གསུམ་གྱི་ཁྲུན་ཙམ་དུ་སྣང་ངོ་། །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བར་དུ་ནི་པད་མ་དེའི་འཕང་དུ་ལྷའི་དཔག་ཚད་ལྔ་བཅུ་པར་སྣང་ངོ་།
en: From this lotus , which appeared to tower above the street to three times the height of a man, great light streamed forth, visible as far as the gods’ realm of the Four Great Kings, to whom the lotus appeared to be fifty “celestial leagues” tall.

source: །སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷའི་ནང་དུ་ནི་པད་མ་དེའི་འཕང་དུ་ནི་དཔག་ཚད་བརྒྱ་པར་སྣང་ངོ་།
en: In the realm of the Thirty-Three Gods, it appeared to be one hundred leagues tall.

source: །འོག་མིན་གྱི་ལྷའི་བར་དུ་ནི་པད་མ་དེའི་འཕང་དཔག་ཚད་ཕྱེད་པར་སྣང་ངོ་།
en: It could be seen as far as the Akaniṣṭha realm, where it appeared to be half a league tall.

source: །པད་མ་དེའི་འདབ་མ་དག་ལས་ཚིག་དང་དོན་དང་ཚིགས་སུ་བཅད་པ་སྣ་ཚོགས་བྱུང་སྟེ། སེམས་ཅན་གང་དག་ས་འདི་ལ་གནས་པ་དེ་དག་གིས་ཚིགས་སུ་བཅད་པ་འདི་དག་ཐོས་སོ།
en: From the petals of this lotus emanated various stanzas with words rich in meaning. All beings on this earth heard the following stanzas:

source: །སངས་རྒྱས་ཞིང་འདིར་གང་ཟག་སྡིག་པ་མེད་པ་གཅིག་སྐྱེས་པ།
en: “A unique, faultless man has arisen in this buddha field.

source: །གཅིག་པུས་བདུད་ཀྱི་སྡེ་ནི་དཔུང་དང་བཞོན་པར་བཅས་པ་བཅོམ།
en: By him alone Māra and his forces—soldiers and mounts—were defeated.

source: །སངས་རྒྱས་དཔའ་བོ་གཅིག་གིས་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར།
en: “Through the unique courage of the Buddha, the wheel of the Dharma was turned.

source: །ཉག་གཅིག་འགྲོ་བ་དག་ལ་ཕན་ཕྱིར་བྱོན་པ་ཐེ་ཚོམ་མེད།
en: He alone has come, without a doubt, in order to benefit the world. “In this world, the two most disciplined men, proficient in moral precepts, are Upatiṣya and Kaulita.

source: །མཁས་པ་བསྟན་བཅོས་ཚུལ་མང་རིག་པ་ཆོས་དོན་མཐར་འདོད་པ། །ཚུལ་ཤེས་པང་ནས་སྐྱེས་དང་ཉེ་རྒྱལ་མཆོག་འདིར་སྟོན་པས་བཏུལ།
en: They are knowledgeable and proficient in many treatises, and their purpose is the Dharma and liberation.

source: །འགྲོ་བ་ཀུན་ལ་ཕན་དོན་རིག་མཁས་དམ་ཆོས་གསུང་བ་ཆེ།
en: The great learned sage, skilled in the affairs that benefit the entire world, teaches the sacred Dharma.

source: །ཐུབ་པ་སྨྲ་མཆོག་འཇིག་རྟེན་ཀུན་གྱིས་མཆོད་པས་དེ་རིང་གཤེགས།
en: This best of teachers, revered by the whole world, is coming today.

source: །དུས་གསུམ་གཤེགས་པ་སྟོན་པ་དགེ་སྦྱོང་རྒྱལ་པོ་བསླབ་གསུམ་འཆང་།
en: “This teacher who demonstrates the knowledge of the three times, king of all monks, promoter of the three types of instructions,

source: །ཚད་མེད་ཆོས་དོན་རིག་པ་མི་དང་ལྷར་བཅས་འགྲོ་བ་སྐྱོབ།
en: Protector of human and divine beings, knower of the infinite significance of the Dharma,

source: །འཇིག་རྟེན་དོན་དང་ཕན་སྤྱོད་མཁས་པ་ཡེ་ཤེས་ཆེན་པོའི་སྒྲོན།
en: Expert in what helps and benefits the world, great lamp of wisdom,

source: །དམ་པ་གསུང་བ་དྲི་མ་གསུམ་སྤངས་དེ་རིང་འདིར་ཀུན་སྟོན།
en: Speaker of truth who is free from the three stains, will teach everything today. “He exerted himself for the sake of all people, and his mind never growing weary,

source: །སྡུག་བསྔལ་ཕོངས་པའི་འགྲོ་བ་ཐམས་ཅད་རྣམ་གྲོལ་ཞིང་། །འཇིག་རྟེན་དོན་སླད་མི་བསྙེལ་བློ་གྲོས་མངའ་བས་སྤྱད།
en: Thus liberating all beings, afflicted as they are by suffering.

source: །མ་རིག་པ་ཡིས་བསྒྲིབས་པའི་མིག་ཅན་དག་ལ་ཡང་།
en: To those whose eyes are veiled by ignorance

source: །དམ་པའི་ཆོས་ཀྱིས་མིག་ནི་ཇི་བཞིན་རབ་ཏུ་སྦྱིན།
en: He gives, accordingly, the eye of the sacred Dharma.

source: །ཐམས་ཅད་ལྡན་པའི་འཁོར་འདི་འདིར་ནི་ཚོགས་འགྱུར་གྱིས།
en: “As his entire congregation has gathered together here,

source: །དོན་གྱི་དམ་པ་གཟིགས་པ་གཟུགས་བཟང་མཆོག་མངའ་ལ།
en: This leonine speaker who reveals the absolute truth,

source: །སྟོབས་དང་ལྡན་ཞིང་མཆོག་དང་མཆོག་མ་ཡིན་མཁྱེན་པ།
en: Supremely beautiful, endowed with the ten strengths,

source: །སྨྲ་བའི་སེང་གེ་རིང་པོར་མི་ཐོགས་འདིར་གཤེགས་སོ།
en: Knower of what is and is not supreme, will arrive here before long.

source: །འགྲོ་བ་སྡུག་བསྔལ་རྒྱ་མཚོར་གནས་པ་གཟིགས་ནས་ནི།
en: “Seeing that beings are immersed in a great ocean of suffering, He will come to beat the drum of the Dharma.

source: །དབང་པོ་དྲུག་གི་སྡོམ་པའི་མཆོག་ལ་རབ་གནས་ཤིང་།
en: His six senses are completely under control,

source: །མངོན་པར་ཤེས་པ་དྲུག་མཁྱེན་དྲུག་གི་རྗེས་འབྲང་བ།
en: And his six knowledges follow from the six superknowledges. “This leonine preacher, endowed with the six seeds,

source: །དེ་ནི་ཆོས་ཀྱི་རྔ་ཆེན་བརྡུང་དུ་ཡང་དག་གཤེགས།
en: Will come here to give the six supreme, essential teachings.
